[
    {
    "_op_type": "index",
    "_index": "newsgroup",
    "event_cluster": [
      {
      "id": 1,
      "name": "Trump receives 747 plane from Qatar"
      }
    ],
    "category_cluster": [
      {
      "id": 0,
      "name": ""
      }
    ],
  
    "title": "Is President Trump allowed to accept $400m luxury plane?",
    "author": [
      {
      "name": "Jake Horton"
      },
      {
      "name": "Tom Edgington"
      },
      {
      "name": "Joshua Cheetham"
      }
          ],
          "publication_date": "May 13th, 2025",
          "source": "BBC News",
          "url": "https://www.bbc.com/news/articles/cx2eylpdg9po.amp",
          "bias": "",
  
          "content": "President Donald Trump has said his administration wants to accept a plane worth an estimated $400m (£303m) as a gift from Qatar, calling it 'a great gesture' that he would be 'stupid' to turn down. The potential move has been labelled 'wildly illegal' by some members of the rival Democratic Party - something the White House denies - and it has attracted criticism from some of Trump's supporters. Qatar itself earlier said the reports about the plane were 'inaccurate', and that negotiations were continuing. The news comes as Trump visits several countries in the Middle East, including Qatar. On Sunday, US media reported that the Trump administration was preparing to accept a Boeing jumbo jet from the Qatari royal family - saying that the plane would be refitted and used temporarily as Air Force One, the name for the plane used by presidents. Trump later posted on Truth Social: 'The Defense Department is getting a gift, free of charge, of a 747 aircraft to replace the 40-year-old Air Force One, temporarily, in a very public and transparent transaction.' When questioned by reporters, Trump said: 'It's a great gesture from Qatar. I appreciate it very much. I would never be one to turn down that kind of an offer.' In February, Trump said he was 'not happy with Boeing' about delays to two new Air Force One jets that he is expecting to receive directly from the firm. He added that the White House could instead 'buy a plane or get a plane, or something'. The Qatari plane was pictured in Palm Beach, Florida, in February where Trump inspected it. It is currently fitted with three bedrooms, a private lounge and an office, according to its specification summary document from 2015. A Qatari official has told CNN the plane is being given from the Qatari defence ministry to the Pentagon, and that it will be modified to meet Air Force One's safety and security standards. Experts say this is likely to take years, which means the plane may not be ready for use until near the end of Trump's term. Trump has said the plane will go directly to his presidential library after he leaves office, and that he 'wouldn't be using it' after his presidency. Nonetheless, the move has led to criticism from Democrats as well as some long-time Trump supporters, including Laura Loomer who said: 'This is really going to be such a stain on the admin if this is true.'Is the gift legal? Several senior Democrats have claimed that accepting the gift would be illegal. Democratic Senator Adam Schiff quoted a section of the US Constitution that said no elected official could accept 'any present... of any kind whatever' from the leader of a foreign state without congressional approval. Frank Cogliano, a professor of American history at the University of Edinburgh, says this clause 'was intended to prevent bribery to influence the government'. 'It is certainly stretching the Constitution and we have not seen a gift on this scale, or of this nature', says Professor Andrew Moran, a constitutional law expert at London Metropolitan University. There have been a number of other laws passed by Congress relating to the acceptance of foreign gifts, such as the Foreign Gifts and Decorations Act of 1966, which means that congressional consent is required for the acceptance of foreign gifts above a certain value. Currently US officials can accept gifts valued at less than $480 (£363). Although Trump has referred to the plane ultimately going to his 'library', experts have suggested he really means his museum foundation. Ex-presidents typically have a library housing their archive of documents, and a museum - typically funded by private donations - full of memorabilia and open to the public. Experts who BBC Verify spoke to said the fact that the plane could be given to the administration - and not to the president directly - before being transferred to his museum, may not get around the potential violation of the constitution."
      },
  
      { 
    "_op_type": "index",
    "_index": "newsgroup",
      "event_cluster": [
              {
              "id": 1,
              "name": "Trump receives 747 plane from Qatar"
              }
          ],
  
          "category_cluster": [
              {
              "id": 0,
              "name": ""
              }
          ],
  
          "title": "Trump accepts jet from Qatar, will refit to serve as Air Force One",
          "author": [
              {
              "name": "Fox News Staff"
              }
          ],
          "publication_date": "2025-05-14",
          "source": "Fox News",
          "url": "https://www.foxnews.com/politics/trump-accepts-jet-from-qatar-refit-serve-air-force-one.amp",
          "bias": "",
      
          "content": "Amid delays and budget overruns in Boeing's $3.9 billion project, President Donald Trump accepts Qatar's 747 gifted jet, which he will refit to serve as Air Force One. When asked about the latest news, Trump told a reporter at the White House, 'They're giving the United States Air Force a jet, okay, and it's a great thing.' 'You're a terrible reporter. You don't have what it takes to be a reporter,' he said."
          },
      {
      "_op_type": "index",
      "_index": "newsgroup",
          "event_cluster": [
              {
              "id": 1,
              "name": "Trump receives 747 plane from Qatar"
              }
          ],
  
          "category_cluster": [
              {
              "id": 0,
              "name": ""
              }
          ],
      
          "title": "Trump administration poised to accept 'palace in the sky' as a gift for Trump from Qatar: Sources",
          "author": [
              {
              "name": "Jonathan Karl"
              },
              {
              "name": "Katherine Faulders"
              }
          ],
          "publication_date": "2025-05-11",
          "source": "ABC News",
          "url": "https://abcnews.go.com/amp/Politics/trump-administration-poised-accept-palace-sky-gift-trump/story?id=121680511",
          "bias": "",
      
          "content": "In what may be the most valuable gift ever extended to the United States from a foreign government, the Trump administration is preparing to accept a super luxury Boeing 747-8 jumbo jet from the royal family of Qatar -- a gift that is to be available for use by President Donald Trump as the new Air Force One until shortly before he leaves office, at which time ownership of the plane will be transferred to the Trump presidential library foundation, sources familiar with the proposed arrangement told ABC News. The gift had been expected to be announced next week, when Trump visits Qatar on the first foreign trip of his second term, according to sources familiar with the plans. But a senior White House official said the gift will not be presented or gifted while the president is in Qatar this week. In a social media post Sunday night, Trump confirmed his administration was preparing to accept the aircraft, calling it a 'very public and transparent transaction' with the Defense Department. Trump had previously toured the plane, which is so opulently configured it is known as 'a flying palace,' while it was parked at the West Palm Beach International Airport in February. The highly unusual -- unprecedented -- arrangement is sure to raise questions about whether it is legal for the Trump administration, and ultimately, the Trump presidential library foundation, to accept such a valuable gift from a foreign power. Anticipating those questions, sources told ABC News that lawyers for the White House counsel's office and the Department of Justice drafted an analysis for Defense Secretary Pete Hegseth concluding that is legal for the Department of Defense to accept the aircraft as a gift and later turn it over to the Trump library, and that it does not violate laws against bribery or the Constitution's prohibition (the emoluments clause) of any U.S. government official accepting gifts 'from any King, Prince or foreign State.' Sources told ABC News that Attorney General Pam Bondi and Trump's top White House lawyer David Warrington concluded it would be 'legally permissible' for the donation of the aircraft to be conditioned on transferring its ownership to Trump's presidential library before the end of his term, according to sources familiar with their determination. The sources said Bondi provided a legal memorandum addressed to the White House counsel's office last week after Warrington asked her for advice on the legality of the Pentagon accepting such a donation. White House press secretary Karoline Leavitt said in a statement to ABC News, 'Any gift given by a foreign government is always accepted in full compliance with all applicable laws.' 'President Trump's Administration is committed to full transparency,' Leavitt added. Ali Al-Ansari, Qatar's media attaché, said in a statement that the transfer of an aircraft for 'temporary use' as Air Force One is current under consideration by Qatar's Ministry of Defense and the U.S. Department of Defense. The plane will initially be transferred to the United States Air Force, which will modify the 13-year-old aircraft to meet the U.S. military specifications required for any aircraft used to transport the president of the United States, multiple sources familiar with the proposed arrangement said."
      },
      {
      "_op_type": "index",
      "_index": "newsgroup",
          "event_cluster": [
              {
              "id": 1,
              "name": "Trump receives 747 plane from Qatar"
              }
          ],
  
          "category_cluster": [
              {
              "id": 0,
              "name": ""
              }
          ],
  
          "title": "Qatar Plane Trump Air Force One",
          "author": [
              {
              "name": "New York Times Staff"
              }
          ],
          "publication_date": "2025-05-21",
            "source": "The New York Times",
            "url": "https://www.nytimes.com/2025/05/21/us/politics/qatar-plane-trump-air-force-one.html",
          "bias": "",
  
          "content": "The United States has accepted a 747 jetliner as a gift from the government of Qatar, and the Air Force has been asked to figure out a way to rapidly upgrade it so it can be put into use as a new Air Force One for President Trump, a Defense Department spokesman confirmed Wednesday. “The secretary of defense has accepted a Boeing 747 from Qatar in accordance with all federal rules and regulations,” the chief Pentagon spokesman, Sean Parnell, said in a statement. “The Department of Defense will work to ensure proper security measures and functional-mission requirements are considered for an aircraft used to transport the president of the United States.” The plane, which industry executives estimated is worth about $200 million, will require extensive work before it can be considered secure enough to carry Mr. Trump, Pentagon officials have acknowledged in recent days. “Any civilian aircraft will take significant modifications to do so,” Troy Meink, the Air Force secretary, said on Tuesday during Senate testimony. “Based on the secretary’s direction, we are postured and we’re off looking at that right now, what it’s going to take for that particular aircraft.” Mr. Trump also confirmed the gift on Wednesday. “They’re giving the United States Air Force a jet, and it’s a great thing,” he said at the White House. The plan has drawn concern from members of Congress, who worry that Mr. Trump will pressure the Air Force to do the work so fast that sufficient security measures are not built into the plane, such as missile defense systems or even systems to protect the plane from the electromagnetic effects of a nuclear blast. “If President Trump insists on converting this plane to a hardened Air Force One before 2029, I worry about the pressures you may be under to cut corners on operational security,” Senator Tammy Duckworth, Democrat of Illinois, said as Mr. Meink was testifying. The Pentagon has not given an estimate of when the work on the Qatari plane might be done, even though Mr. Trump and the White House have made clear the president wants it soon, perhaps even by the end of the year. “We will make sure that we do what’s necessary to ensure security of the aircraft,” Mr. Meink said at the Senate hearing. “I will be quite clear and discuss that with the secretary up to the president if necessary if we feel there’s any threats that we are unable to address.” The gift also has drawn questions from both Democrats and Republicans in Congress, who worry that Qatar may be trying to improperly influence Mr. Trump, or that the plane itself might have listening devices. Qatar’s prime minister, Sheikh Mohammed bin Abdulrahman bin Jassim Al Thani, publicly said on Monday for the first time that his government had approved turning over the plane as a gift, rejecting the idea of it being an attempt to influence the president. Sheikh Mohammed said he did not know why people thought of the gift as a bribe or “something that Qatar wants to buy and influence with this administration. I don’t see any, honestly, a valid reason for that.” He added: “We are a country that would like to have strong partnership and strong friendship, and anything that we provide to any country, it’s provided out of respect for this partnership and it’s a two-way relationship. It’s mutually beneficial for Qatar and for the United States.” The new plane will be the third being retrofitted for use as Air Force One, replacing two planes that have been in use for 35 years and have had maintenance problems."
          },
          { "_op_type": "index",
      "_index": "newsgroup",
          "event_cluster": [
              {
              "id": 2,
              "name": "Leo XIV elected as new Roman Catholic Pope"
              }
          ],
      
          "category_cluster": [
              {
              "id": 0,
              "name": ""
              }
          ],
  
          "title": "White smoke rises from Vatican as cardinals agree on Pope Francis' successor",
          "author": [
              {
              "name": "CNN Staff"
              }
          ],
          "publication_date": "2025-05-08",
            "source": "CNN",
            "url": "https://amp.cnn.com/cnn/2025/05/08/europe/new-pope-conclave-white-smoke-vatican-intl",
          "bias": "",
  
          "content": "White smoke has risen above the Sistine Chapel, the signal that cardinals have chosen a new pope on the second day of the conclave. Leo was chosen just two days after a group of 133 cardinals gathered in conclave to select a new pontiff, suggesting that he quickly impressed his peers during the secretive process. He is expected to build on Francis’ reforms. His predecessors, Francis and Benedict XVI, were both revealed in the evening of the conclave’s second day, while John Paul II, the longest-reigning pope of modern times, was selected on the third day, in 1978."
          },
          { "_op_type": "index",
      "_index": "newsgroup",
          "event_cluster": [
              {
              "id": 2,
              "name": "Leo XIV elected as new Roman Catholic Pope"
              }
          ],
  
          "category_cluster": [
              {
              "id": 0,
              "name": ""
              }
          ],
      
          "title": "Who is Robert Prevost, the new Pope Leo XIV?",
          "author": [
              {
              "name": "Paul Kirby"
              },
              {
              "name": "Ione Wells"
              }
          ],
          "publication_date": "2025-05-09",
            "source": "BBC News",
            "url": "https://www.bbc.com/news/articles/c0ln80lzk7ko",
          "bias": "",
  
          "content": "Robert Francis Prevost, 69, has become the 267th occupant of the throne of St Peter and will be known as Leo XIV. He is the first American to fill the role of pope, although he is considered as much a cardinal from Latin America because of the many years he spent as a missionary in Peru. Born in Chicago in 1955 to parents of Spanish and Franco-Italian descent, Leo served as an altar boy and was ordained in 1982. Although he moved to Peru three years later, he returned regularly to the US to serve as a priest and a prior in his home city. He has Peruvian nationality and is fondly remembered as a figure who worked with marginalized communities and helped build bridges. He spent 10 years as a local parish pastor and as a teacher at a seminary in Trujillo in north-western Peru. In his first words as Pope, Leo spoke fondly of his predecessor Francis. 'We still hear in our ears the weak but always courageous voice of Pope Francis who blessed us,' he said. 'United and hand-in-hand with God, let us advance together,' he told cheering crowds."
          },
          { "_op_type": "index",
      "_index": "newsgroup",
          "event_cluster": [
              {
              "id": 2,
              "name": "Leo XIV elected as new Roman Catholic Pope"
              }
          ],
  
          "category_cluster": [
              {
              "id": 0,
              "name": ""
              }
          ],
  
          "title": "How does the conclave pick a new pope? 8 things to know",
          "author": [
              {
              "name": "Dan Cooney"
              }
          ],
          "publication_date": "2025-04-29",
            "source": "PBS NewsHour",
            "url": "https://www.pbs.org/newshour/world/how-does-the-conclave-pick-a-new-pope-8-things-to-know",
          "bias": "",
  
          "content": "Any baptized Catholic male can be elected pope, regardless of whether they're a member of the priesthood, according to canon law. The only requirement is that the person be a baptized Catholic male. However, in practice, the pope is almost always chosen from among the cardinals. The conclave is held in the Sistine Chapel, and the cardinals are sequestered from the outside world until a new pope is elected. Voting continues until a candidate receives a two-thirds majority. The results are signaled by smoke: white smoke indicates a successful election, while black smoke means no decision has been made."
          },
          { "_op_type": "index",
      "_index": "newsgroup",
          "event_cluster": [
              {
              "id": 2,
              "name": "Leo XIV elected as new Roman Catholic Pope"
              }
          ],
  
          "category_cluster": [
              {
              "id": 0,
              "name": ""
              }
          ],
  
          "title": "Who is Cardinal Robert Prevost? Leo XIV is first American pope",
          "author": [
              {
              "name": "Chris Williams"
              },
              {
              "name": "Chris Boex"
              }
          ],
          "publication_date": "2025-05-08",
            "source": "LiveNOW from FOX",
            "url": "https://www.livenowfox.com/news/new-pope-elected-who-is",
          "bias": "",
  
          "content": "The College of Cardinals elected Cardinal Robert Prevost, 69, to become the next leader of the worldwide Catholic Church. He'll take the name Pope Leo XIV. The news came just over an hour after white smoke finally billowed from the Sistine Chapel late Thursday afternoon, signaling to the world that the papal conclave had chosen a successor to Pope Francis, who died last month. The papal conclave began Wednesday afternoon and lasted 25 hours, 37 minutes, and 58 seconds, according to a count by LiveNOW from FOX. It was not immediately clear if the election was after four ballots or five ballots, but either way, it would be in line with recent history. Pope Benedict XVI was elected in 2005 after four ballots in two days while Pope Francis was elected after five ballots in two days in 2013."
          }
]